IntergatedCircuits/STM32_XPD/STM32L4_XPD/inc/xpd_adc.h
/** @addtogroup ADC_Core_Exported_Functions
 * @{ */
void            ADC_vInit               (ADC_HandleType * pxADC, const ADC_InitType * pxConfig);
void            ADC_vDeinit             (ADC_HandleType * pxADC);
void            ADC_vChannelConfig      (ADC_HandleType * pxADC, const ADC_ChannelInitType axChannels[],
                                         uint8_t ucChannelCount);

void            ADC_vStart              (ADC_HandleType * pxADC);
void            ADC_vStop               (ADC_HandleType * pxADC);
XPD_ReturnType  ADC_ePollStatus         (ADC_HandleType * pxADC, ADC_OperationType eOperation,
                                         uint32_t ulTimeout);

void            ADC_vStart_IT           (ADC_HandleType * pxADC);
void            ADC_vStop_IT            (ADC_HandleType * pxADC);
void            ADC_vIRQHandler         (ADC_HandleType * pxADC);

XPD_ReturnType  ADC_eStart_DMA          (ADC_HandleType * pxADC, void * pvAddress);
void            ADC_vStop_DMA           (ADC_HandleType * pxADC);

void            ADC_vWatchdogConfig     (ADC_HandleType * pxADC, ADC_WatchdogType eWatchdog,
                                         uint16_t usLowThd, uint16_t usHighThd);
ADC_WatchdogType ADC_eWatchdogStatus    (ADC_HandleType * pxADC);

/**
 * @brief Return the result of the last ADC regular conversion.
 * @param pxADC: pointer to the ADC handle structure
 * @return The conversion result
 */
__STATIC_INLINE uint16_t ADC_usGetValue(ADC_HandleType * pxADC)
{
    return (uint16_t)pxADC->Inst->DR;
}

/**
 * @brief Put the ADC in deep power down state, reducing power consumption and losing calibration.
 * @param hadc: pointer to the ADC handle structure
 */
__STATIC_INLINE void ADC_vShutdown(ADC_HandleType * pxADC)
{
    ADC_REG_BIT(pxADC,CR,DEEPPWD) = 1;
}

/** @} */

/** @} */

/** @defgroup ADC_Injected ADC Injected Conversions
 * @{ */

/** @defgroup ADC_Injected_Exported_Types ADC Injected Exported Types
 * @{ */

/** @brief ADC injected trigger sources */
typedef enum
{
    ADC_INJTRIGGER_TIM1_TRGO  = 0,  /*!< TIM1 Trigger Out */
    ADC_INJTRIGGER_TIM1_CC4   = 1,  /*!< TIM1 Channel 4 */
    ADC_INJTRIGGER_TIM2_TRGO  = 2,  /*!< TIM2 Trigger Out */
    ADC_INJTRIGGER_TIM2_CC1   = 3,  /*!< TIM2 Channel 1 */
    ADC_INJTRIGGER_TIM3_CC4   = 4,  /*!< TIM3 Channel 4 */
    ADC_INJTRIGGER_TIM4_TRGO  = 5,  /*!< TIM4 Trigger Out */
    ADC_INJTRIGGER_EXTI15     = 6,  /*!< EXTI Line 15 */
    ADC_INJTRIGGER_TIM8_CC4   = 7,  /*!< TIM8 Channel 4 */
    ADC_INJTRIGGER_TIM1_TRGO2 = 8,  /*!< TIM1 Trigger Out 2 */
    ADC_INJTRIGGER_TIM8_TRGO  = 9,  /*!< TIM8 Trigger Out */
    ADC_INJTRIGGER_TIM8_TRGO2 = 10, /*!< TIM8 Trigger Out 2 */
    ADC_INJTRIGGER_TIM3_CC3   = 11, /*!< TIM3 Channel 3 */
    ADC_INJTRIGGER_TIM3_TRGO  = 12, /*!< TIM3 Trigger Out */
    ADC_INJTRIGGER_TIM3_CC1   = 13, /*!< TIM3 Channel 1 */
    ADC_INJTRIGGER_TIM6_TRGO  = 14, /*!< TIM6 Trigger Out */
    ADC_INJTRIGGER_TIM15_TRGO = 15, /*!< TIM15 Trigger Out */
    ADC_INJTRIGGER_SOFTWARE   = 16  /*!< Implicit trigger by software on start call */
}ADC_InjTriggerSourceType;

/** @brief ADC injected channel setup structure */
typedef struct
{
    FunctionalState      AutoInjection;     /*!< Automatic injected conversion after regular group
                                                 @note External triggers must be disabled */
    FunctionalState      DiscontinuousMode; /*!< Sets discontinuous mode
                                                 @note Cannot be used with auto injection */
    struct {
        ADC_InjTriggerSourceType InjSource; /*!< Source of the conversion trigger */
        EdgeType                 Edge;      /*!< Trigger edges that initiate conversion */
    }Trigger;
    FunctionalState      ContextQueue;      /*!< Context queue feature */
    ADC_OversamplingType Oversampling;      /*!< Oversampling configuration for injected group */
}ADC_InjectedInitType;

/** @} */

/** @addtogroup ADC_Injected_Exported_Functions
 * @{ */
void            ADC_vInjectedInit           (ADC_HandleType * pxADC,
                                             const ADC_InjectedInitType * pxConfig);
void            ADC_vInjectedChannelConfig  (ADC_HandleType*pxADC,
                                             const ADC_ChannelInitType axChannels[],
                                             uint8_t ucChannelCount);

void            ADC_vInjectedStart          (ADC_HandleType * pxADC);
void            ADC_vInjectedStop           (ADC_HandleType * pxADC);

void            ADC_vInjectedStart_IT       (ADC_HandleType * pxADC);
void            ADC_vInjectedStop_IT        (ADC_HandleType * pxADC);

/**
 * @brief Return the result of an ADC injected conversion.
 * @param pxADC: pointer to the ADC handle structure
 * @param ucIndex: index of channel on injected ADC conversion sequence (0-indexed)
 * @return The conversion result
 */
__STATIC_INLINE uint16_t ADC_usInjectedValue(ADC_HandleType * pxADC, uint8_t ucIndex)
{
    /* clear the flag for injected end of conversion */
    ADC_FLAG_CLEAR(pxADC, JEOC);

    return (uint16_t)((&pxADC->Inst->JDR1)[ucIndex]);
}

/** @} */

/** @} */

#if (ADC_COUNT > 1)
/** @defgroup ADC_MultiMode Multi ADC Mode Conversions
 * @{ */

/** @defgroup ADC_MultiMode_Exported_Types Multi ADC Mode Exported Types
 * @{ */

/** @brief Multi ADC modes */
typedef enum
{
/* all three ADCs operate independently */
    ADC_MULTIMODE_SINGE                        = 0, /*!< The ADCs operate independently */
/* ADC 1 and 2 common operation */
    ADC_MULTIMODE_DUAL_REGSIMULT               = 6, /*!< ADC1+2 regular simultaneous mode */
    ADC_MULTIMODE_DUAL_INJECSIMULT             = 5, /*!< ADC1+2 injected simultaneous mode */
    ADC_MULTIMODE_DUAL_REGSIMULT_ALTTRIGGER    = 2, /*!< ADC1+2 regular simultaneous, alternate trigger mode */
    ADC_MULTIMODE_DUAL_REGSIMULT_INJECSIMULT   = 1, /*!< ADC1+2 regular simultaneous + injected simultaneous mode */
    ADC_MULTIMODE_DUAL_REGINTERL_INJECSIMULT   = 3, /*!< ADC1+2 regular interleaved + injected simultaneous mode */
    ADC_MULTIMODE_DUAL_ALTTRIGGER              = 9, /*!< ADC1+2 alternate trigger mode */
    ADC_MULTIMODE_DUAL_INTERLEAVED             = 7, /*!< ADC1+2 interleaved mode */
}ADC_MultiModeType;

