IntergatedCircuits/STM32_XPD/STM32L4_XPD/inc/xpd_adc.h
/** @brief ADC DMA access modes */
typedef enum
{
    ADC_DMAACCESSMODE_DISABLED   = 0, /*!< DMA mode disabled, each ADC uses its own DMA channel */
    ADC_DMAACCESSMODE_12_10_BITS = 2, /*!< DMA of ADC master is used, for 12 and 10 bit resolutions */
    ADC_DMAACCESSMODE_8_6_BITS   = 3, /*!< DMA of ADC master is used, for 8 and 6 bit resolutions */
}ADC_DMAAccessModeType;

/** @brief Multi ADC setup structure */
typedef struct
{
    ADC_MultiModeType     Mode;               /*!< Multi-mode operation type configuration */
    ADC_DMAAccessModeType DMAAccessMode;      /*!< DMA access mode configuration */
    uint8_t               InterSamplingDelay; /*!< Delay between 2 sampling phases [1..12] */
}ADC_MultiModeInitType;

/** @} */

/** @addtogroup ADC_MultiMode_Exported_Functions
 * @{ */
void            ADC_vMultiModeInit          (ADC_HandleType * pxADC,
                                             const ADC_MultiModeInitType * pxConfig);
XPD_ReturnType  ADC_eMultiModeStart_DMA     (ADC_HandleType * pxADC, void * pvAddress);
void            ADC_vMultiModeStop_DMA      (ADC_HandleType * pxADC);

/**
 * @brief Return the result of the last common ADC regular conversions.
 * @param pxADC: pointer to the ADC handle structure
 * @return A pair of conversion results in a single word
 */
__STATIC_INLINE uint32_t ADC_ulMultiModeValues(ADC_HandleType * pxADC)
{
    /* return the multi mode conversion values */
    return ADC_COMMON(pxADC)->CDR.w;
}

/** @} */

/** @} */
#endif

/** @defgroup ADC_Calibration ADC Calibration
 * @{ */

/** @addtogroup ADC_Calibration_Exported_Functions
 * @{ */
XPD_ReturnType  ADC_eCalibrate          (ADC_HandleType * pxADC, boolean_t eDifferential);
/** @} */

/** @} */

/** @} */

#define XPD_ADC_API
#include <xpd_rcc_pc.h>
#undef XPD_ADC_API

#ifdef __cplusplus
}
#endif

#endif /* __XPD_ADC_H_ */
